#과제 - 클래스의 개념과 필요성
print("클래스는 멤버변수와 멤버함수의 집합이다. 멤버변수란 클래스 설계도 내부에만 존재하는 변수다. 멤버함수란 클래스 설계도 내부에 존재하는 함수로 멤버변수에 접근할 수 있다.")
print("클래스를 사용하면 비슷한 속성과 기능을 가진 변수를 번거롭게 여러번 선언할 필요가 없다. 또 편리하게 인스턴스를 생성하고 기능을 활용할 수 있다. 따라서 코드를 더 깔끔하고 효율적으로 만들어 준다.")
#과제 - 상속의 개념과 필요성
print("상속은 부모 클래스의 멤버변수와 멤버함수를 자식 클래스에게 그대로 물려주는 것으로, 자식 클래스는 부모 클래스와 동일한 멤버변수와 멤버함수를 가지게 된다.")
print("상속은 비슷한 카테고리이면서 공통 멤버변수와 멤버함수를 가졌지만, 각각 고유한 멤버함수나 멤버변수를 가지고 있어야하는 클래스들을 선언할때 매우 유용하다.")
#과제 - 인스턴스의 개념과 클래스와의 차이
print("인스턴스란 클래스로 인해 선언된 변수다. 클래스가 멤버변수와 멤버함수에 대한 내용을 가진 설계도라면, 인스턴스는 그런 멤버변수 값과 멤버함수를 포함하고 있는 변수다.")
#과제 - 상속과 포함에 대해 설명, 어떻게 구분해서 사용할 수 있을지
print("상속은 위에서 설명했고 포함은 다른 클래스의 멤버변수를 어떤 클래스의 인스턴스를 선언할때 사용하는 것이다. 상속은 '차 - SUV/버스/트럭'처럼")
print("어떤 클래스의 하위 카테고리 클래스가 존재하는 경우 유용하게 사용할 수 있고, 포함은 '캐릭터 - 물건'처럼 어떤 클래스와 그 클래스가 사용하는 클래스가 공통점이 없을 경우 유용하게 사용할 수 있다.")